## Task
More exploration of pandas basics

## Notebook summary
* Reading text files
* Reading binary files
* Getting data from DBs

## References
* *Python for Data Analysis*, Wes McKinney

In [29]:
# display output from all cmds just like Python shell
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

import numpy as np
print 'numpy.version = ', np.__version__
import pandas as pd
print 'pandas.version = ', pd.__version__
from pandas import Series, DataFrame

import sys

numpy.version =  1.11.2
pandas.version =  0.19.1

In [22]:
# Import data from CSV file
!cat sample_data.csv

pd.read_csv('sample_data.csv')
pd.read_csv('sample_data.csv', header=None)
pd.read_csv('sample_data.csv', names=['H1','H2','H3','H4'])
pd.read_csv('sample_data.csv', index_col=0)
pd.read_csv('sample_data.csv', index_col=1)
pd.read_csv('sample_data.csv', index_col=0, skiprows=[2])


pd.read_csv('sample_data.csv', index_col=0, nrows=2)
part = pd.read_csv('sample_data.csv', index_col=0, chunksize=2)
part

for i, p in enumerate(part):
    print 'Part ', i
    p
    
# See also from_csv to read Series data from file

,Col1,Col2,Col3
Row1,Val11,Val12,Val13
Row2,Val21,Val22,Val23
Row3,Val31,Val32,Val33

  Unnamed: 0   Col1   Col2   Col3
0       Row1  Val11  Val12  Val13
1       Row2  Val21  Val22  Val23
2       Row3  Val31  Val32  Val33

      0      1      2      3
0   NaN   Col1   Col2   Col3
1  Row1  Val11  Val12  Val13
2  Row2  Val21  Val22  Val23
3  Row3  Val31  Val32  Val33

     H1     H2     H3     H4
0   NaN   Col1   Col2   Col3
1  Row1  Val11  Val12  Val13
2  Row2  Val21  Val22  Val23
3  Row3  Val31  Val32  Val33

       Col1   Col2   Col3
Row1  Val11  Val12  Val13
Row2  Val21  Val22  Val23
Row3  Val31  Val32  Val33

      Unnamed: 0   Col2   Col3
Col1
Val11       Row1  Val12  Val13
Val21       Row2  Val22  Val23
Val31       Row3  Val32  Val33

       Col1   Col2   Col3
Row1  Val11  Val12  Val13
Row3  Val31  Val32  Val33

       Col1   Col2   Col3
Row1  Val11  Val12  Val13
Row2  Val21  Val22  Val23

Part  0

       Col1   Col2   Col3
Row1  Val11  Val12  Val13
Row2  Val21  Val22  Val23

Part  1

       Col1   Col2   Col3
Row3  Val31  Val32  Val33

In [33]:
pd.read_csv('sample_data.csv').to_csv('out.csv')
! cat out.csv
print '---'

pd.read_csv('sample_data.csv').to_csv(sys.stdout)
print '---'

pd.read_csv('sample_data.csv').to_csv(sys.stdout, index=False)

,Unnamed: 0,Col1,Col2,Col3
0,Row1,Val11,Val12,Val13
1,Row2,Val21,Val22,Val23
2,Row3,Val31,Val32,Val33
---
,Unnamed: 0,Col1,Col2,Col3
0,Row1,Val11,Val12,Val13
1,Row2,Val21,Val22,Val23
2,Row3,Val31,Val32,Val33
---
Unnamed: 0,Col1,Col2,Col3
Row1,Val11,Val12,Val13
Row2,Val21,Val22,Val23
Row3,Val31,Val32,Val33